# Cumulative salary sum

* Source: https://leetcode.com/problems/find-cumulative-salary-of-an-employee/
* Source: https://towardsdatascience.com/twenty-five-sql-practice-exercises-5fc791e24082

The following table holds monthly salary information for several employees. Write a query to get, for each month, the cumulative sum of an employeeâ€™s salary over a period of 3 months, excluding the most recent month. The result should be ordered by ascending employee ID and month.

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

In [2]:
%%html
<style>
table {float:left}
</style>

## The `employees` table

In [3]:
%%sql 

DROP TABLE IF EXISTS employees;
CREATE TABLE employees (
    id INT,
    pay_month INT,
    salary MONEY
);

INSERT INTO employees
VALUES
    (1, 1, 20),
    (2, 1, 20),
    (1, 2, 30),
    (2, 2, 30),
    (3, 2, 40),
    (1, 3, 40),
    (3, 3, 60),
    (1, 4, 60),
    (3, 4, 70);
    
SELECT * FROM employees;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
9 rows affected.
9 rows affected.

[(1, 1, '$20.00'),
 (2, 1, '$20.00'),
 (1, 2, '$30.00'),
 (2, 2, '$30.00'),
 (3, 2, '$40.00'),
 (1, 3, '$40.00'),
 (3, 3, '$60.00'),
 (1, 4, '$60.00'),
 (3, 4, '$70.00')]

## The expected output

| id | pay_month | salary  | cumulative_sum |
|--- |---------- |-------- |--------------- |
| 1  | 1         | \$20.00 | \$20.00        |
| 1  | 2         | \$30.00 | \$50.00        | 
| 1  | 3         | \$40.00 | \$90.00        |
| 2  | 1         | \$20.00 | \$20.00        |
| 3  | 2         | \$40.00 | \$40.00        |
| 3  | 3         | \$60.00 | \$100.00       |

# Type your SQL below

In [ ]:
# %%sql
#
# Type your query here